# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000
proc = 0
sum = expenses
count = expenses
general_educational = educational_grant*10
i = 1
while i < 10:
    i = i + 1
    proc = sum * .03
    sum = sum + proc
    count += sum
print('Студенту надо попросить',round(count-general_educational,2) ,'рублей')
